gdmatrix-ws/gdmatrix-ws-security-ri/src/main/resources/org/santfeliu/security/provider/psis/XMLValidateCMS.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
<!-- DSS message validating a correct CMS -->
<!-- Result: Valid -->
    <dss:VerifyRequest xmlns:dss="urn:oasis:names:tc:dss:1.0:core:schema"
      Profile="urn:oasis:names:tc:dss:1.0:profiles:XSS"
      xmlns:xss="urn:oasis:names:tc:dss:1.0:profiles:XSS">
      <dss:OptionalInputs>
        <xss:ReturnSignedResponse />
        <dss:ReturnProcessingDetails />
        <dss:ReturnSigningTime/>
        <dss:ReturnSignerIdentity/>
        <xss:ReturnX509CertificateInfo>
          <xss:AttributeDesignator Name="urn:oasis:names:tc:dss:1.0:profiles:XSS:certificateAttributes:SerialNumber" />
          <xss:AttributeDesignator Name="urn:oasis:names:tc:dss:1.0:profiles:XSS:certificateAttributes:IssuerDistinguishedName:commonName" />
          <xss:AttributeDesignator Name="urn:oasis:names:tc:dss:1.0:profiles:XSS:certificateAttributes:NotBefore" />
          <xss:AttributeDesignator Name="urn:oasis:names:tc:dss:1.0:profiles:XSS:certificateAttributes:NotAfter" />
        </xss:ReturnX509CertificateInfo>
        <xss:ReturnSignatureInfo>
          <xss:AttributeDesignator Name="urn:oasis:names:tc:dss:1.0:profiles:XSS:signatureAttributes:DigestAlgorithm" />
          <xss:AttributeDesignator Name="urn:oasis:names:tc:dss:1.0:profiles:XSS:signatureAttributes:DigestEncryptionAlgorithm" />
          <xss:AttributeDesignator Name="urn:oasis:names:tc:dss:1.0:profiles:XSS:signatureAttributes:SignatureAlgorithm" />
          <xss:AttributeDesignator Name="urn:oasis:names:tc:dss:1.0:profiles:XSS:signatureAttributes:SignatureValue" />
        </xss:ReturnSignatureInfo>
      </dss:OptionalInputs>
      <dss:SignatureObject>
        <dss:Base64Signature Type="urn:ietf:rfc:3369">${SIGNATURE}</dss:Base64Signature>
      </dss:SignatureObject>
    </dss:VerifyRequest>
  </soapenv:Body>
</soapenv:Envelope>